[
    {
        "id": 1,
        "imageUrl": "https://drive.google.com/uc?export=view&id=1PDSq7kk4bjTM1Ps_-DSKNpkgg7-jUY6K",
        "name": "Dark Web",
        "description": "The Dark Web is a very dangerous place.",
        "type": "internet",
        "article": "The dark web refers to encrypted online content that is not indexed by conventional search engines. Sometimes, the dark web is also called the dark net. The dark web is a part of the deep web, which just refers to websites that do not appear on search engines. Most deep web content consists of private files hosted on Dropbox and its competitors or subscriber-only databases rather than anything illegal.\n\n Specific browsers, such as Tor Browser, are required to reach the dark web.1﻿ Using the dark web often provides considerably more privacy than just using Tor to access the web. Many dark web sites simply provide standard web services with more secrecy, which benefits political dissidents and people trying to keep medical conditions private. Unfortunately, online marketplaces for drugs, exchanges for stolen data, and other illegal activities get most of the attention."
    },
    {
        "id": 2,
        "imageUrl": "https://drive.google.com/uc?export=view&id=1PBcdn5EnCTnLZHcjq51focp3UCjTIDmV",
        "name": "macOS Big Sur",
        "description": "macOS Big Sur changes everything.",
        "type": "os",
        "article": "macOS Big Sur elevates the most advanced desktop operating system in the world to a new level of power and beauty. Experience Mac to the fullest with a refined new design. Enjoy the biggest Safari update ever. Discover new features for Maps and Messages. And get even more transparency around your privacy."
    },
    {
        "id": 3,
        "imageUrl": "https://drive.google.com/uc?export=view&id=1PCqLjk-R9ZtdTyRg_EYvAG26QdHYfkK0",
        "name": "SwiftUI",
        "description": "Better Apps. Less Code.",
        "type": "development",
        "article": "SwiftUI is an innovative, exceptionally simple way to build user interfaces across all Apple platforms with the power of Swift. Build user interfaces for any Apple device using just one set of tools and APIs. With a declarative Swift syntax that’s easy to read and natural to write, SwiftUI works seamlessly with new Xcode design tools to keep your code and design perfectly in sync. Automatic support for Dynamic Type, Dark Mode, localization, and accessibility means your first line of SwiftUI code is already the most powerful UI code you’ve ever written."
    },
    {
        "id": 4,
        "imageUrl": "https://drive.google.com/uc?export=view&id=1PCzo_1dCj9O69XX5pz_apT1mFzTbjvPh",
        "name": "iOS 14",
        "description": "iOS 14, less code, better result.",
        "type": "ios",
        "article": "iOS 14 brings a fresh look to the things you do most often, making them easier than ever. New features help you get what you need in the moment. And the apps you use all the time become even more intelligent, more personal, and more private."
    },
    {
        "id": 5,
        "imageUrl": "https://flutter.dev/assets/flutter-lockup-1caf6476beed76adec3c477586da54de6b552b2f42108ec5bc68dc63bae2df75.png",
        "name": "Flutter",
        "description": "One codebase and deploy on Android & iOS",
        "type": "development",
        "article": "Fast Development\nPaint your app to life in milliseconds with Stateful Hot Reload. Use a rich set of fully-customizable widgets to build native interfaces in minutes.\n\nExpressive and Flexible UI\nQuickly ship features with a focus on native end-user experiences. Layered architecture allows for full customization, which results in incredibly fast rendering and expressive and flexible designs.\n\nNative Performance\nFlutter’s widgets incorporate all critical platform differences such as scrolling, navigation, icons and fonts, and your Flutter code is compiled to native ARM machine code using Dart's native compilers."
    },
    {
        "id": 6,
        "imageUrl": "https://hackernoon.com/hn-images/1*nlhD6_U277a1s_VxSbH11g.jpeg",
        "name": "Ionic",
        "description": "My experience with Ionic",
        "type": "development",
        "article": "Ionic is a framework that allows you to use just one codebase and build apps for iOS and Android. The codebase is Angular, that why Ionic and React Native(Javascript) is the framework most use by web developers that wants to start to code for mobile.\n\nThe code is structured in this way there is the HTML that defines all the components and the basic layout of your app, then we find the SCSS that like in the web development is used to style the app, in the end, we have the most important part that is the TypeScript that makes do something to your app, for example, calculate BMI or read QRCodes. All these files are in group folders that are the same as your pages so you can make happen stuff between these pages.\n\nThe documentation is pretty easy to find and well written. There are tons of plugins so nowadays you can develop almost anything using this framework. Everyone who has a simple knowledge of web development can start developing apps in Ionic. So I recommend everybody to try out and share their fantasy with the world."
    }
]
